
void OOD()
{
    // SOLID
    // Single responsibility — принцип единственной ответственности
    // Open-closed — принцип открытости / закрытости
    // Liskov substitution — принцип подстановки Барбары Лисков
    // Interface segregation — принцип разделения интерфейса
    // Dependency inversion — принцип инверсии зависимостей

    // DRY - Don’t Repeat Yourself
    // Не повторяйся
    // заключается в том, чтобы избегать дублирования информации в системе, что означает: каждый
    // фрагмент знаний или логики должен иметь единственное, авторитетное представление. Это
    // достигается вынесением повторяющихся участков кода в функции или методы, использованием
    // библиотек и фреймворков, а также применением шаблонов и абстракций, что упрощает поддержку
    // кода, снижает вероятность ошибок и улучшает его читаемость. 
    
    // KISS - Keep It Simple, Stupid
    // делай короче и проще
    // означает, что большинство систем лучше всего работают, когда они остаются максимально
    // простыми, избегая ненужной сложности. Этот принцип применяется в проектировании, разработке
    // программного обеспечения и управлении проектами для облегчения понимания, обслуживания и
    // внесения изменений. Основные положения включают минимизацию сложности, избегание избыточных
    // функций и использование простых, понятных решений. 
    
    // YAGNI -You Aren’t Gonna Need It
    // Вам это не понадобится
    // это принцип разработки ПО, согласно которому не следует реализовывать функциональность, 
    // которая не нужна прямо сейчас, а лишь предполагается, что она может пригодиться в будущем.

    // BDUF - Big Design Up Front
    // Глобальное проектирование прежде всего

    // APO - Avoid Premature Optimization
    // Избегайте преждевременной оптимизации
 
    // Бритва Оккама 
    // Не следует привлекать новые сущности без крайней на то необходимости
}